import { LocaleData } from 'types/locals'
import { EMAIL, GITHUB, SKILLS, TELEGRAM, TELEPHONE } from '../common'

export const ua: LocaleData = {
    words: {
        resume: 'Резюме',
        name: "Ім'я",
        birthday: 'День народження',
        place: 'Місце знаходження',
        adress: 'Адреса',
        telephone: 'Телефон',
        telegram: 'Телеграм',
        email: 'Електронна пошта',
        personalData: 'Особиста інформація',
        education: 'Освіта',
        experience: 'Досвід роботи',
        skills: 'Навички',
        projects: 'Проекти',
        testTask: 'Тестові завдання',
        uses: 'Використанні технології',
        languages: 'Мови',
        more: 'Більше',
        view: 'Переглянути',
        inProgress: 'В розробці',
    },
    personal: {
        name: 'Олександр Соляр',
        birthday: '4 Cічня 1999',
        place: 'Київська обл.',
        github: GITHUB,
        telephone: TELEPHONE,
        telegram: TELEGRAM,
        email: EMAIL,
    },
    languages: [
        {
            name: 'Українська',
            level: 'Рідна',
        },
        {
            name: 'Російська',
            level: 'С1',
        },
        {
            name: 'Англійська',
            level: 'B1',
        },
    ],
    summary: {
        title: 'React FrontEnd Developer',
        salary: 'Очікувана зарплата від 1400$',
        text: `Я маю 8-річний досвід у розробці програмного забезпечення. Самостійно вивчав різноманітні мови програмування, зокрема Lua, Haskell, C++ та Python. Зараз моїми основними мовами програмування є Javascript та Typescript. Мої знання про ці мови програмування є досконалими, оскільки колись писав свою власну мову програмування: надбудову з типізацією для Lua. Мені подобається використовувати ці знання для створення функціонального та естетичного програмного забезпечення. Я маю впевнене розуміння ООП, REST API, SOLID та інших архітектурних принципів та паттернів. Я шукаю можливість працювати в захопливому середовищі, де я можу розвивати свої навички у будь-якому напрямку. Мені подобається постійно вчитися та самовдосконалюватися, тому я швидко освоюю нові ідеї та технології.`,
    },
    skills: SKILLS,
    educations: [
        {
            start: 'Вересень 2014',
            end: 'Травень 2018',
            name: 'Молодший Спеціаліст - Проектування програмного забезпечення',
            place: 'Коледж НАУ, Васильків, Україна',
        },
        {
            start: 'Вересень 2018',
            name: 'Спеціаліст - Інженерія програмного забезпечення',
            place: 'Державний Університет Телекомунікацій, Київ, Україна',
            extra: '5 курс (не закінчив)',
        },
    ],
    experience: [
        {
            position: 'Системний адміністратор',
            place: 'Інтернет провайдер Crystall',
            period: '2 роки',
            description: `В якості системного адміністратору я вивчав мережеві технології зі стеку OSI, тому маю уявлення як в інтернеті все працює. Також налаштовував мережеві пристрої, діагностував їх та виявляв проблеми. Розробляв скрипти на Node.js для автоматизації певних процесів. Створив власний консольний клієнт для протоколу telnet, з підсвіткою синтаксису та іншими корисними функціями. Також займався написанням шаблонів конфігурацій для мережевих пристроїв (свічів, олтів) на шаблонизаторі Pug. Після себе залишив базу готових шаблонів.`,
        },
        {
            position: 'Frontend Developer (React)',
            place: 'AzSoft',
            period: '1 рік',
            description: `Протягом мого досвіду роботи я брав участь у кількох проектах. Спочатку я працював на проекті, що використовував бібліотеку mxGraph на Angular для побудови діаграм. Я переробляв структури даних, вирішував проблеми та допомагав іншим членам команди. Надалі, я працював виключно з React та взяв участь в проектах, де мав досвід верстки користувацького інтерфейсу та анімації ігрових панелей. В останньому проекті я здійснював налаштування та вибір бібліотеки для побудови діаграм послідовності. Я розробляв архітектуру та брав активну участь у дискусіях з приводу її покращення, планував рефакторинг та постійно допомагав з підвищенням ефективності проекту. За цей час я збільшив свій досвід у розробці на React та Typescript, а також ознайомився з новими бібліотеками, такими як Chakra UI, MobX, React Flow та React Hook Form.`,
        },
        {
            position: 'Frontend Developer (React)',
            place: 'Forex Tester',
            period: '3 місяці',
            description:
                'Взяв участь у розробці веб-застосунку для тестування своїх стратегій трейдингу на зібраних в минулому даних. Розбирався з модифікованою бібліотекою для малювання графіків трейдингу. Займався виправленням багів та версткою користувацького інтерфейсу. Також узяв участь у рефакторингу цього проекту.',
        },
    ],
    projects: [
        {
            name: 'Tua',
            description: `Власна мова програмування, яка являє собою надбудову для Lua з статичною типізацією. Надихався Typescript і черпав з нього ідеї. Була темою дипломної роботи. Писалась в цілях саморозвитку. Я досконально вивчав компілятори, процесс трансляції та різні системи типізації, механізми взаємодії в мовах програмування. Прочитав багато книг на цю тему. Перший проект в якому я навчився рефакторингу та оптимізації. На даний момент проект закинуто, планую повернутись до нього пізніше.`,
            technologies: ['Node.js'],
        },
        {
            name: 'TelnetMy',
            description: `Консольний клієнт для протоколу telnet. Створений щоб автоматизувати рутинні дії під час роботи системного адміністратору. Реалізована автоматична авторизація, де можна було обирати пристрій та акаунт із списку, щоб не вводити ip адресу та логін з паролем вручну. По можливості старався наповнювати проект новими фічами. Так в ньому з'явилась підсвідка тексту: різних чисел, дат, серійних номерів, що допомагає швидше орієнтуватись у потоці тексту. В планах перевести проект на Typescript, та доповнити його ще і веб-клієнтом для протоколу telnet.`,
            technologies: ['Node.js'],
            repository: 'https://github.com/lehaisanya/telnet-my',
        },
        {
            name: 'Music metadata',
            description:
                'Клієнт-серверний застосунок для редагування метатегів музичних файлів (mp3) зі зручним інтерфейсом, та можливістю редагувати відразу декілька файлів. Також пізніше я додав можливість слухати ці музичні файли. Писався виключно для власного використання. Планую перетворити його в повноцінний музичний програвач.',
            technologies: [
                'React',
                'Typescript',
                'MobX',
                'Chakra UI',
                'Express',
            ],
            repository: 'https://github.com/lehaisanya/music-metadata',
        },
        {
            name: 'language',
            description: `Тестовий компілятор для видуманої абстрактної мови програмування. Створений щоб краще розібратись з процесом компіляції. Цей компілятор створює логи для кожної дії, що дозволяє бачити увесь процес компіляції покроково, нічого не випускаючи з поля зору. На даний момент реалізовані тільки два модулі: лексер і парсер. В планах завершити компілятор повністю.`,
            technologies: ['Typescript'],
            repository: 'https://github.com/lehaisanya/language',
        },
        {
            name: 'Резюме',
            description: `Цей самий проект. Повністю адаптивний. З можливістю змінювати мову.`,
            technologies: ['React', 'Typescript', 'Chakra UI'],
            repository: 'https://github.com/lehaisanya/resume',
        },
    ],
    testTasks: [
        {
            name: 'Телефонна книга',
            description: '',
            technologies: [
                'React',
                'Typescript',
                'MobX',
                'SASS',
                'React Router Dom',
            ],
            repository: 'https://github.com/lehaisanya/test-phonebook',
            viewLink: 'https://lehaisanya.github.io/test-phonebook/',
        },
        {
            name: 'Таблиця та Модальне вікно',
            description: '',
            technologies: [
                'React',
                'Typescript',
                'react-hook-form',
                'Redux (toolkit)',
            ],
            repository: 'https://github.com/lehaisanya/test-table-and-modal',
            viewLink: 'https://lehaisanya.github.io/test-table-and-modal/',
        },
        {
            name: 'RxJS Таймер',
            description: '',
            technologies: ['React', 'Typescript', 'RxJS'],
            repository: 'https://github.com/lehaisanya/test-timer-rxjs',
            viewLink: 'https://lehaisanya.github.io/test-timer-rxjs/',
        },
    ],
}
